vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MKM33ZA5_DFP.pdsc
    <condition id='allOf.driver.pit, device=MKM33ZA5.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='pit'/>
      <require condition='device.MKM33ZA5.internal_condition'/>
    </condition>
    <condition id='component.serial_manager.condition_id'>
      <require condition='allOf.anyOf=component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual, component.lists, driver.common, device=MKM33ZA5.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual, component.lists, driver.common, device=MKM33ZA5.internal_condition'>
      <require condition='anyOf.component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lists'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require condition='device.MKM33ZA5.internal_condition'/>
    </condition>
    <condition id='anyOf.component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual.internal_condition'>
      <accept Cclass='Device' Cgroup='SDK Utilities' Csub='serial_manager_swo'/>
      <accept Cclass='Device' Cgroup='SDK Utilities' Csub='serial_manager_uart'/>
      <accept Cclass='Device' Cgroup='SDK Utilities' Csub='serial_manager_virtual'/>
    </condition>
    <condition id='component.serial_manager_swo.condition_id'>
      <require condition='allOf.device=MKM33ZA5.internal_condition'/>
    </condition>
    <condition id='component.serial_manager_uart.condition_id'>
      <require condition='allOf.anyOf=driver.uart, component.uart_adapter, device=MKM33ZA5.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.uart, component.uart_adapter, device=MKM33ZA5.internal_condition'>
      <require condition='anyOf.driver.uart.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='uart_adapter'/>
      <require condition='device.MKM33ZA5.internal_condition'/>
    </condition>
    <condition id='anyOf.driver.uart.internal_condition'>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='uart'/>
    </condition>
    <condition id='component.serial_manager_virtual.condition_id'>
      <require condition='allOf.device=MKM33ZA5.internal_condition'/>
    </condition>
    <condition id='component.uart_adapter.condition_id'>
      <require condition='allOf.driver.uart, device=MKM33ZA5.internal_condition'/>
    </condition>
    <condition id='allOf.driver.uart, device=MKM33ZA5.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='uart'/>
      <require condition='device.MKM33ZA5.internal_condition'/>
    </condition>
    <condition id='device.CMSIS.condition_id'>
      <require condition='allOf.CMSIS_Include_core_cm, device=MKM33ZA5.internal_condition'/>
    </condition>
    <condition id='allOf.CMSIS_Include_core_cm, device=MKM33ZA5.internal_condition'>
      <require Cclass='CMSIS' Cgroup='CORE'/>
      <require condition='device.MKM33ZA5.internal_condition'/>
    </condition>
    <condition id='device_id.MKM33Z64Axxx5, MKM33Z128Axxx5.internal_condition'>
      <accept Dname='MKM33Z64ACLH5' Dvendor='NXP:11'/>
      <accept Dname='MKM33Z64ACLL5' Dvendor='NXP:11'/>
      <accept Dname='MKM33Z128ACLH5' Dvendor='NXP:11'/>
      <accept Dname='MKM33Z128ACLL5' Dvendor='NXP:11'/>
    </condition>
    <condition id='device.RTE.condition_id'>
      <require condition='allOf.device_id=MKM33Z64Axxx5, MKM33Z128Axxx5, driver.dma, driver.dmamux.internal_condition'/>
    </condition>
    <condition id='allOf.device_id=MKM33Z64Axxx5, MKM33Z128Axxx5, driver.dma, driver.dmamux.internal_condition'>
      <require condition='device_id.MKM33Z64Axxx5, MKM33Z128Axxx5.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='dma'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='dmamux'/>
    </condition>
    <condition id='device.linker.condition_id'>
      <require condition='allOf.device_id=MKM33Z64Axxx5, MKM33Z128Axxx5.internal_condition'/>
    </condition>
    <condition id='allOf.device_id=MKM33Z64Axxx5, MKM33Z128Axxx5.internal_condition'>
      <require condition='device_id.MKM33Z64Axxx5, MKM33Z128Axxx5.internal_condition'/>
    </condition>
    <condition id='device_ids.MKM33Z64Axxx5.internal_condition'>
      <accept Dname='MKM33Z64ACLH5' Dvendor='NXP:11'/>
      <accept Dname='MKM33Z64ACLL5' Dvendor='NXP:11'/>
    </condition>
    <condition id='allOf.toolchains=mdk, device_ids=MKM33Z64Axxx5.condition_id'>
      <require condition='toolchains.mdk.internal_condition'/>
      <require condition='device_ids.MKM33Z64Axxx5.internal_condition'/>
    </condition>
    <condition id='toolchains.mdk.internal_condition'>
      <accept Tcompiler='ARMCC'/>
    </condition>
    <condition id='device_ids.MKM33Z128Axxx5.internal_condition'>
      <accept Dname='MKM33Z128ACLH5' Dvendor='NXP:11'/>
      <accept Dname='MKM33Z128ACLL5' Dvendor='NXP:11'/>
    </condition>
    <condition id='allOf.toolchains=mdk, device_ids=MKM33Z128Axxx5.condition_id'>
      <require condition='toolchains.mdk.internal_condition'/>
      <require condition='device_ids.MKM33Z128Axxx5.internal_condition'/>
    </condition>
    <condition id='allOf.toolchains=armgcc, device_ids=MKM33Z64Axxx5.condition_id'>
      <require condition='toolchains.armgcc.internal_condition'/>
      <require condition='device_ids.MKM33Z64Axxx5.internal_condition'/>
    </condition>
    <condition id='toolchains.armgcc.internal_condition'>
      <accept Tcompiler='GCC'/>
    </condition>
    <condition id='allOf.toolchains=armgcc, device_ids=MKM33Z128Axxx5.condition_id'>
      <require condition='toolchains.armgcc.internal_condition'/>
      <require condition='device_ids.MKM33Z128Axxx5.internal_condition'/>
    </condition>
