vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MKM33ZA5_DFP.pdsc
    <condition id='allOf.toolchains=iar, device_ids=MKM33Z64Axxx5.condition_id'>
      <require condition='toolchains.iar.internal_condition'/>
      <require condition='device_ids.MKM33Z64Axxx5.internal_condition'/>
    </condition>
    <condition id='toolchains.iar.internal_condition'>
      <accept Tcompiler='IAR'/>
    </condition>
    <condition id='allOf.toolchains=iar, device_ids=MKM33Z128Axxx5.condition_id'>
      <require condition='toolchains.iar.internal_condition'/>
      <require condition='device_ids.MKM33Z128Axxx5.internal_condition'/>
    </condition>
    <condition id='device.project_template.condition_id'>
      <require condition='allOf.component.uart_adapter, device_id=MKM33Z64Axxx5, MKM33Z128Axxx5, device.startup, driver.clock, driver.common, driver.gpio, driver.irtc, driver.port, driver.smc, driver.uart, anyOf=allOf=component.serial_manager, component.serial_manager_uart, utility.assert, utility.debug_console, utility.debug_console_template_config, allOf=utility.assert_lite, utility.debug_console_lite.internal_condition'/>
    </condition>
    <condition id='allOf.component.uart_adapter, device_id=MKM33Z64Axxx5, MKM33Z128Axxx5, device.startup, driver.clock, driver.common, driver.gpio, driver.irtc, driver.port, driver.smc, driver.uart, anyOf=allOf=component.serial_manager, component.serial_manager_uart, utility.assert, utility.debug_console, utility.debug_console_template_config, allOf=utility.assert_lite, utility.debug_console_lite.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='uart_adapter'/>
      <require condition='device_id.MKM33Z64Axxx5, MKM33Z128Axxx5.internal_condition'/>
      <require Cclass='Device' Cgroup='Startup' Csub=''/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='clock'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='gpio'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='rtc'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='port'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='smc'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='uart'/>
      <require condition='anyOf.allOf=component.serial_manager, component.serial_manager_uart, utility.assert, utility.debug_console, utility.debug_console_template_config, allOf=utility.assert_lite, utility.debug_console_lite.internal_condition'/>
    </condition>
    <condition id='anyOf.allOf=component.serial_manager, component.serial_manager_uart, utility.assert, utility.debug_console, utility.debug_console_template_config, allOf=utility.assert_lite, utility.debug_console_lite.internal_condition'>
      <accept condition='allOf.component.serial_manager, component.serial_manager_uart, utility.assert, utility.debug_console, utility.debug_console_template_config.internal_condition'/>
      <accept condition='allOf.utility.assert_lite, utility.debug_console_lite.internal_condition'/>
    </condition>
    <condition id='allOf.component.serial_manager, component.serial_manager_uart, utility.assert, utility.debug_console, utility.debug_console_template_config.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='serial_manager'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='serial_manager_uart'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='assert'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='debug_console'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='debug console template config'/>
    </condition>
    <condition id='allOf.utility.assert_lite, utility.debug_console_lite.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='assert_lite'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='debug_console_lite'/>
    </condition>
    <condition id='device.startup.condition_id'>
      <require condition='allOf.device.system, device=MKM33ZA5.internal_condition'/>
    </condition>
    <condition id='allOf.device.system, device=MKM33ZA5.internal_condition'>
      <require Cclass='Device' Cgroup='CMSIS' Csub='MKM33ZA5_system'/>
      <require condition='device.MKM33ZA5.internal_condition'/>
    </condition>
    <condition id='allOf.toolchains=iar.condition_id'>
      <require condition='toolchains.iar.internal_condition'/>
    </condition>
    <condition id='allOf.toolchains=armgcc.condition_id'>
      <require condition='toolchains.armgcc.internal_condition'/>
    </condition>
    <condition id='allOf.toolchains=mdk.condition_id'>
      <require condition='toolchains.mdk.internal_condition'/>
    </condition>
    <condition id='device.system.condition_id'>
      <require condition='allOf.device.CMSIS, device=MKM33ZA5.internal_condition'/>
    </condition>
    <condition id='allOf.device.CMSIS, device=MKM33ZA5.internal_condition'>
      <require Cclass='Device' Cgroup='CMSIS' Csub='MKM33ZA5_header'/>
      <require condition='device.MKM33ZA5.internal_condition'/>
    </condition>
    <condition id='driver.adc16.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM33Z64Axxx5, MKM33Z128Axxx5.internal_condition'/>
    </condition>
    <condition id='allOf.driver.common, device_id=MKM33Z64Axxx5, MKM33Z128Axxx5.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require condition='device_id.MKM33Z64Axxx5, MKM33Z128Axxx5.internal_condition'/>
    </condition>
    <condition id='driver.afe.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM33Z64Axxx5, MKM33Z128Axxx5.internal_condition'/>
    </condition>
    <condition id='driver.clock.condition_id'>
      <require condition='allOf.device=MKM33ZA5.internal_condition'/>
    </condition>
    <condition id='driver.cmp.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM33Z64Axxx5, MKM33Z128Axxx5.internal_condition'/>
    </condition>
    <condition id='driver.cmsis_i2c.condition_id'>
      <require condition='allOf.CMSIS_Driver_Include.I2C, device.RTE, driver.i2c, device_id=MKM33Z64Axxx5, MKM33Z128Axxx5, driver.i2c_dma.internal_condition'/>
    </condition>
