vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MKM33ZA5_DFP.pdsc
    <condition id='allOf.CMSIS_Driver_Include.I2C, device.RTE, driver.i2c, device_id=MKM33Z64Axxx5, MKM33Z128Axxx5, driver.i2c_dma.internal_condition'>
      <require Cclass='CMSIS Driver' Cgroup='I2C' Capiversion='2.4.0'/>
      <require Cclass='Device' Cgroup='SDK Project Template' Csub='RTE_Device'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='i2c'/>
      <require condition='device_id.MKM33Z64Axxx5, MKM33Z128Axxx5.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='i2c_dma'/>
    </condition>
    <condition id='driver.cmsis_spi.condition_id'>
      <require condition='allOf.CMSIS_Driver_Include.SPI, device.RTE, driver.spi, device_id=MKM33Z64Axxx5, MKM33Z128Axxx5, driver.spi_dma.internal_condition'/>
    </condition>
    <condition id='allOf.CMSIS_Driver_Include.SPI, device.RTE, driver.spi, device_id=MKM33Z64Axxx5, MKM33Z128Axxx5, driver.spi_dma.internal_condition'>
      <require Cclass='CMSIS Driver' Cgroup='SPI' Capiversion='2.3.0'/>
      <require Cclass='Device' Cgroup='SDK Project Template' Csub='RTE_Device'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='spi'/>
      <require condition='device_id.MKM33Z64Axxx5, MKM33Z128Axxx5.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='spi_dma'/>
    </condition>
    <condition id='driver.cmsis_uart.condition_id'>
      <require condition='allOf.CMSIS_Driver_Include.USART, device.RTE, driver.uart, device_id=MKM33Z64Axxx5, MKM33Z128Axxx5, driver.uart_dma.internal_condition'/>
    </condition>
    <condition id='allOf.CMSIS_Driver_Include.USART, device.RTE, driver.uart, device_id=MKM33Z64Axxx5, MKM33Z128Axxx5, driver.uart_dma.internal_condition'>
      <require Cclass='CMSIS Driver' Cgroup='USART' Capiversion='2.4.0'/>
      <require Cclass='Device' Cgroup='SDK Project Template' Csub='RTE_Device'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='uart'/>
      <require condition='device_id.MKM33Z64Axxx5, MKM33Z128Axxx5.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='uart_dma'/>
    </condition>
    <condition id='driver.common.condition_id'>
      <require condition='allOf.device=MKM33ZA5.internal_condition'/>
    </condition>
    <condition id='allOf.cores=cm0p.condition_id'>
      <require condition='cores.cm0p.internal_condition'/>
    </condition>
    <condition id='cores.cm0p.internal_condition'>
      <accept Dcore='Cortex-M0+'/>
    </condition>
    <condition id='driver.crc.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM33Z64Axxx5, MKM33Z128Axxx5.internal_condition'/>
    </condition>
    <condition id='driver.dma.condition_id'>
      <require condition='allOf.driver.common, driver.dmamux, device_id=MKM33Z64Axxx5, MKM33Z128Axxx5.internal_condition'/>
    </condition>
    <condition id='allOf.driver.common, driver.dmamux, device_id=MKM33Z64Axxx5, MKM33Z128Axxx5.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='dmamux'/>
      <require condition='device_id.MKM33Z64Axxx5, MKM33Z128Axxx5.internal_condition'/>
    </condition>
    <condition id='driver.dmamux.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM33Z64Axxx5, MKM33Z128Axxx5.internal_condition'/>
    </condition>
    <condition id='driver.ewm.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM33Z64Axxx5, MKM33Z128Axxx5.internal_condition'/>
    </condition>
    <condition id='driver.flash.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM33Z64Axxx5, MKM33Z128Axxx5.internal_condition'/>
    </condition>
    <condition id='driver.gpio.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM33Z64Axxx5, MKM33Z128Axxx5.internal_condition'/>
    </condition>
    <condition id='driver.i2c.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM33Z64Axxx5, MKM33Z128Axxx5.internal_condition'/>
    </condition>
    <condition id='driver.i2c_dma.condition_id'>
      <require condition='allOf.driver.dma, driver.i2c, device=MKM33ZA5.internal_condition'/>
    </condition>
    <condition id='allOf.driver.dma, driver.i2c, device=MKM33ZA5.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='dma'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='i2c'/>
      <require condition='device.MKM33ZA5.internal_condition'/>
    </condition>
    <condition id='driver.i2c_edma.condition_id'>
      <require condition='allOf.driver.i2c, device=MKM33ZA5.internal_condition'/>
    </condition>
    <condition id='allOf.driver.i2c, device=MKM33ZA5.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='i2c'/>
      <require condition='device.MKM33ZA5.internal_condition'/>
    </condition>
    <condition id='driver.irtc.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM33Z64Axxx5, MKM33Z128Axxx5.internal_condition'/>
    </condition>
    <condition id='driver.llwu.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM33Z64Axxx5, MKM33Z128Axxx5.internal_condition'/>
    </condition>
    <condition id='driver.lptmr.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM33Z64Axxx5, MKM33Z128Axxx5.internal_condition'/>
    </condition>
    <condition id='driver.pit.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM33Z64Axxx5, MKM33Z128Axxx5.internal_condition'/>
    </condition>
    <condition id='driver.pmc.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM33Z64Axxx5, MKM33Z128Axxx5.internal_condition'/>
    </condition>
    <condition id='driver.port.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM33Z64Axxx5, MKM33Z128Axxx5.internal_condition'/>
    </condition>
    <condition id='driver.qtmr_2.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM33Z64Axxx5, MKM33Z128Axxx5.internal_condition'/>
    </condition>
    <condition id='driver.rcm.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM33Z64Axxx5, MKM33Z128Axxx5.internal_condition'/>
    </condition>
    <condition id='driver.rnga.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM33Z64Axxx5, MKM33Z128Axxx5.internal_condition'/>
    </condition>
    <condition id='driver.sim.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM33Z64Axxx5, MKM33Z128Axxx5.internal_condition'/>
    </condition>
    <condition id='driver.slcd.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM33Z64Axxx5, MKM33Z128Axxx5.internal_condition'/>
    </condition>
    <condition id='driver.slcd_engine.condition_id'>
      <require condition='allOf.anyOf=driver.slcd_ftp12557, driver.slcd_gdh_1247wp, driver.slcd_lcd_s401m16kr, driver.slcd_od_6010, device=MKM33ZA5.internal_condition'/>
    </condition>
