vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MKM33ZA5_DFP.pdsc
    <condition id='allOf.anyOf=driver.slcd_ftp12557, driver.slcd_gdh_1247wp, driver.slcd_lcd_s401m16kr, driver.slcd_od_6010, device=MKM33ZA5.internal_condition'>
      <require condition='anyOf.driver.slcd_ftp12557, driver.slcd_gdh_1247wp, driver.slcd_lcd_s401m16kr, driver.slcd_od_6010.internal_condition'/>
      <require condition='device.MKM33ZA5.internal_condition'/>
    </condition>
    <condition id='anyOf.driver.slcd_ftp12557, driver.slcd_gdh_1247wp, driver.slcd_lcd_s401m16kr, driver.slcd_od_6010.internal_condition'>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='slcd_ftp12557'/>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='slcd_gdh_1247wp'/>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='slcd_lcd_s401m16kr'/>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='slcd_od_6010'/>
    </condition>
    <condition id='driver.slcd_ftp12557.condition_id'>
      <require condition='allOf.driver.slcd_engine, device=MKM33ZA5.internal_condition'/>
    </condition>
    <condition id='allOf.driver.slcd_engine, device=MKM33ZA5.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='slcd_engine'/>
      <require condition='device.MKM33ZA5.internal_condition'/>
    </condition>
    <condition id='driver.slcd_gdh_1247wp.condition_id'>
      <require condition='allOf.driver.slcd_engine, device=MKM33ZA5.internal_condition'/>
    </condition>
    <condition id='driver.slcd_lcd_s401m16kr.condition_id'>
      <require condition='allOf.driver.slcd_engine, device=MKM33ZA5.internal_condition'/>
    </condition>
    <condition id='driver.slcd_od_6010.condition_id'>
      <require condition='allOf.driver.slcd_engine, device=MKM33ZA5.internal_condition'/>
    </condition>
    <condition id='driver.smc.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM33Z64Axxx5, MKM33Z128Axxx5.internal_condition'/>
    </condition>
    <condition id='driver.spi.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM33Z64Axxx5, MKM33Z128Axxx5.internal_condition'/>
    </condition>
    <condition id='driver.spi_dma.condition_id'>
      <require condition='allOf.driver.dma, driver.spi, device=MKM33ZA5.internal_condition'/>
    </condition>
    <condition id='allOf.driver.dma, driver.spi, device=MKM33ZA5.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='dma'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='spi'/>
      <require condition='device.MKM33ZA5.internal_condition'/>
    </condition>
    <condition id='driver.sysmpu.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM33Z64Axxx5, MKM33Z128Axxx5.internal_condition'/>
    </condition>
    <condition id='driver.uart.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM33Z64Axxx5, MKM33Z128Axxx5.internal_condition'/>
    </condition>
    <condition id='driver.uart_dma.condition_id'>
      <require condition='allOf.driver.dma, driver.uart, device=MKM33ZA5.internal_condition'/>
    </condition>
    <condition id='allOf.driver.dma, driver.uart, device=MKM33ZA5.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='dma'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='uart'/>
      <require condition='device.MKM33ZA5.internal_condition'/>
    </condition>
    <condition id='driver.vref.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM33Z64Axxx5, MKM33Z128Axxx5.internal_condition'/>
    </condition>
    <condition id='driver.wdog.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM33Z64Axxx5, MKM33Z128Axxx5.internal_condition'/>
    </condition>
    <condition id='driver.xbar.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM33Z64Axxx5, MKM33Z128Axxx5.internal_condition'/>
    </condition>
    <condition id='utilities.misc_utilities.condition_id'>
      <require condition='allOf.device=MKM33ZA5.internal_condition'/>
    </condition>
    <condition id='utility.assert.condition_id'>
      <require condition='allOf.driver.common, utility.debug_console, device=MKM33ZA5.internal_condition'/>
    </condition>
    <condition id='allOf.driver.common, utility.debug_console, device=MKM33ZA5.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='debug_console'/>
      <require condition='device.MKM33ZA5.internal_condition'/>
    </condition>
    <condition id='utility.assert_lite.condition_id'>
      <require condition='allOf.driver.common, not=utility.assert, utility.debug_console_lite, device=MKM33ZA5.internal_condition'/>
    </condition>
    <condition id='allOf.driver.common, not=utility.assert, utility.debug_console_lite, device=MKM33ZA5.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require condition='not.utility.assert.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='debug_console_lite'/>
      <require condition='device.MKM33ZA5.internal_condition'/>
    </condition>
    <condition id='not.utility.assert.internal_condition'>
      <deny Cclass='Device' Cgroup='SDK Utilities' Csub='assert'/>
    </condition>
    <condition id='utility.debug_console.condition_id'>
      <require condition='allOf.component.serial_manager, driver.common, utility.str, device=MKM33ZA5.internal_condition'/>
    </condition>
    <condition id='allOf.component.serial_manager, driver.common, utility.str, device=MKM33ZA5.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='serial_manager'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='str'/>
      <require condition='device.MKM33ZA5.internal_condition'/>
    </condition>
    <condition id='utility.debug_console_lite.condition_id'>
      <require condition='allOf.anyOf=driver.uart, driver.common, not=utility.debug_console, utility.str, component.uart_adapter, device=MKM33ZA5.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.uart, driver.common, not=utility.debug_console, utility.str, component.uart_adapter, device=MKM33ZA5.internal_condition'>
      <require condition='anyOf.driver.uart.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require condition='not.utility.debug_console.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='str'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='uart_adapter'/>
      <require condition='device.MKM33ZA5.internal_condition'/>
    </condition>
    <condition id='not.utility.debug_console.internal_condition'>
      <deny Cclass='Device' Cgroup='SDK Utilities' Csub='debug_console'/>
    </condition>
    <condition id='utility.debug_console_template_config.condition_id'>
      <require condition='allOf.utility.debug_console, device=MKM33ZA5.internal_condition'/>
    </condition>
    <condition id='allOf.utility.debug_console, device=MKM33ZA5.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='debug_console'/>
      <require condition='device.MKM33ZA5.internal_condition'/>
    </condition>
    <condition id='utility.incbin.condition_id'>
      <require condition='allOf.device=MKM33ZA5.internal_condition'/>
    </condition>
    <condition id='allOf.toolchains=armgcc, mdk.condition_id'>
      <require condition='toolchains.armgcc, mdk.internal_condition'/>
    </condition>
    <condition id='toolchains.armgcc, mdk.internal_condition'>
      <accept Tcompiler='GCC'/>
      <accept Tcompiler='ARMCC'/>
    </condition>
    <condition id='utility.notifier.condition_id'>
      <require condition='allOf.device=MKM33ZA5.internal_condition'/>
    </condition>
    <condition id='utility.shell.condition_id'>
      <require condition='allOf.component.lists, driver.common, utility.str, device=MKM33ZA5.internal_condition'/>
    </condition>
    <condition id='allOf.component.lists, driver.common, utility.str, device=MKM33ZA5.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lists'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='str'/>
      <require condition='device.MKM33ZA5.internal_condition'/>
    </condition>
