vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MKM33ZA5_DFP.pdsc
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='i2c_dma' Cversion='2.0.9' condition='driver.i2c_dma.condition_id'>
      <description>I2C Driver</description>
      <files>
        <file category='sourceC' name='devices/MKM33ZA5/drivers/fsl_i2c_dma.c' projectpath='drivers'/>
        <file category='header' name='devices/MKM33ZA5/drivers/fsl_i2c_dma.h' projectpath='drivers'/>
        <file category='include' name='devices/MKM33ZA5/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='i2c_edma' Cversion='2.0.9' condition='driver.i2c_edma.condition_id'>
      <description>I2C Driver</description>
      <files>
        <file category='sourceC' name='devices/MKM33ZA5/drivers/fsl_i2c_edma.c' projectpath='drivers'/>
        <file category='header' name='devices/MKM33ZA5/drivers/fsl_i2c_edma.h' projectpath='drivers'/>
        <file category='include' name='devices/MKM33ZA5/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='rtc' Cversion='2.3.2' condition='driver.irtc.condition_id'>
      <description>IRTC Driver</description>
      <files>
        <file category='sourceC' name='devices/MKM33ZA5/drivers/fsl_irtc.c' projectpath='drivers'/>
        <file category='header' name='devices/MKM33ZA5/drivers/fsl_irtc.h' projectpath='drivers'/>
        <file category='include' name='devices/MKM33ZA5/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='llwu' Cversion='2.0.5' condition='driver.llwu.condition_id'>
      <description>LLWU Driver</description>
      <files>
        <file category='header' name='devices/MKM33ZA5/drivers/fsl_llwu.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MKM33ZA5/drivers/fsl_llwu.c' projectpath='drivers'/>
        <file category='include' name='devices/MKM33ZA5/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='lptmr' Cversion='2.2.0' condition='driver.lptmr.condition_id'>
      <description>LPTMR Driver</description>
      <files>
        <file category='sourceC' name='devices/MKM33ZA5/drivers/fsl_lptmr.c' projectpath='drivers'/>
        <file category='header' name='devices/MKM33ZA5/drivers/fsl_lptmr.h' projectpath='drivers'/>
        <file category='include' name='devices/MKM33ZA5/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='pit' Cversion='2.2.0' condition='driver.pit.condition_id'>
      <description>PIT Driver</description>
      <files>
        <file category='sourceC' name='devices/MKM33ZA5/drivers/fsl_pit.c' projectpath='drivers'/>
        <file category='header' name='devices/MKM33ZA5/drivers/fsl_pit.h' projectpath='drivers'/>
        <file category='include' name='devices/MKM33ZA5/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='pmc' Cversion='2.0.3' condition='driver.pmc.condition_id'>
      <description>PMC Driver</description>
      <files>
        <file category='header' name='devices/MKM33ZA5/drivers/fsl_pmc.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MKM33ZA5/drivers/fsl_pmc.c' projectpath='drivers'/>
        <file category='include' name='devices/MKM33ZA5/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='port' Cversion='2.5.1' condition='driver.port.condition_id'>
      <description>PORT Driver</description>
      <files>
        <file category='header' name='devices/MKM33ZA5/drivers/fsl_port.h' projectpath='drivers'/>
        <file category='include' name='devices/MKM33ZA5/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='qtmr' Cversion='2.0.1' condition='driver.qtmr_2.condition_id'>
      <description>QTMR Driver</description>
      <files>
        <file category='sourceC' name='devices/MKM33ZA5/drivers/fsl_qtmr.c' projectpath='drivers'/>
        <file category='header' name='devices/MKM33ZA5/drivers/fsl_qtmr.h' projectpath='drivers'/>
        <file category='include' name='devices/MKM33ZA5/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='rcm' Cversion='2.0.4' condition='driver.rcm.condition_id'>
      <description>RCM Driver</description>
      <files>
        <file category='sourceC' name='devices/MKM33ZA5/drivers/fsl_rcm.c' projectpath='drivers'/>
        <file category='header' name='devices/MKM33ZA5/drivers/fsl_rcm.h' projectpath='drivers'/>
        <file category='include' name='devices/MKM33ZA5/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='rnga' Cversion='2.0.2' condition='driver.rnga.condition_id'>
      <description>RNGA Driver</description>
      <files>
        <file category='sourceC' name='devices/MKM33ZA5/drivers/fsl_rnga.c' projectpath='drivers'/>
        <file category='header' name='devices/MKM33ZA5/drivers/fsl_rnga.h' projectpath='drivers'/>
        <file category='include' name='devices/MKM33ZA5/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='sim' Cversion='2.2.0' condition='driver.sim.condition_id'>
      <description>SIM Driver</description>
      <files>
        <file category='header' name='devices/MKM33ZA5/drivers/fsl_sim.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MKM33ZA5/drivers/fsl_sim.c' projectpath='drivers'/>
        <file category='include' name='devices/MKM33ZA5/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='slcd' Cversion='2.1.0' condition='driver.slcd.condition_id'>
      <description>SLCD Driver</description>
      <files>
        <file category='header' name='devices/MKM33ZA5/drivers/fsl_slcd.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MKM33ZA5/drivers/fsl_slcd.c' projectpath='drivers'/>
        <file category='include' name='devices/MKM33ZA5/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='slcd_engine' Cversion='1.0.2' condition='driver.slcd_engine.condition_id'>
      <description>Driver slcd_engine</description>
      <files>
        <file category='sourceC' name='components/slcd_engine/slcd_engine.c' projectpath='slcd'/>
        <file category='header' name='components/slcd_engine/slcd_engine.h' projectpath='slcd'/>
        <file category='header' name='components/slcd_engine/slcd_panel.h' projectpath='slcd'/>
        <file category='include' name='components/slcd_engine/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='slcd_ftp12557' Cversion='1.0.0' condition='driver.slcd_ftp12557.condition_id'>
      <description>Driver slcd_ftp12557</description>
      <RTE_Components_h>
#ifndef SLCD_PANEL_FTP12557_H
#define SLCD_PANEL_FTP12557_H 
#endif
</RTE_Components_h>
      <files>
        <file category='sourceC' name='components/slcd_engine/FTP12557/FTP12557.c' projectpath='slcd'/>
        <file category='header' name='components/slcd_engine/FTP12557/FTP12557.h' projectpath='slcd'/>
        <file category='include' name='components/slcd_engine/FTP12557/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='slcd_gdh_1247wp' Cversion='1.0.1' condition='driver.slcd_gdh_1247wp.condition_id'>
      <description>Driver slcd_gdh_1247wp</description>
      <RTE_Components_h>
#ifndef SLCD_PANEL_GDH_1247WP_H
#define SLCD_PANEL_GDH_1247WP_H 
#endif
</RTE_Components_h>
      <files>
        <file category='sourceC' name='components/slcd_engine/GDH-1247WP/GDH-1247WP.c' projectpath='slcd'/>
        <file category='header' name='components/slcd_engine/GDH-1247WP/GDH-1247WP.h' projectpath='slcd'/>
        <file category='include' name='components/slcd_engine/GDH-1247WP/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='slcd_lcd_s401m16kr' Cversion='1.0.2' condition='driver.slcd_lcd_s401m16kr.condition_id'>
      <description>Driver slcd_lcd_s401m16kr</description>
      <RTE_Components_h>
#ifndef SLCD_PANEL_LCD_S401M16KR_H
#define SLCD_PANEL_LCD_S401M16KR_H 
#endif
</RTE_Components_h>
      <files>
        <file category='sourceC' name='components/slcd_engine/LCD-S401M16KR/LCD-S401M16KR.c' projectpath='slcd'/>
        <file category='header' name='components/slcd_engine/LCD-S401M16KR/LCD-S401M16KR.h' projectpath='slcd'/>
        <file category='include' name='components/slcd_engine/LCD-S401M16KR/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='slcd_od_6010' Cversion='1.0.0' condition='driver.slcd_od_6010.condition_id'>
      <description>Driver slcd_od_6010</description>
      <RTE_Components_h>
#ifndef SLCD_PANEL_OD_6010_H
#define SLCD_PANEL_OD_6010_H 
#endif
</RTE_Components_h>
      <files>
        <file category='sourceC' name='components/slcd_engine/OD-6010/OD-6010.c' projectpath='slcd'/>
        <file category='header' name='components/slcd_engine/OD-6010/OD-6010.h' projectpath='slcd'/>
        <file category='include' name='components/slcd_engine/OD-6010/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='smc' Cversion='2.0.7' condition='driver.smc.condition_id'>
      <description>SMC Driver</description>
      <files>
        <file category='header' name='devices/MKM33ZA5/drivers/fsl_smc.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MKM33ZA5/drivers/fsl_smc.c' projectpath='drivers'/>
        <file category='include' name='devices/MKM33ZA5/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='spi' Cversion='2.1.4' condition='driver.spi.condition_id'>
      <description>SPI Driver</description>
      <files>
        <file category='header' name='devices/MKM33ZA5/drivers/fsl_spi.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MKM33ZA5/drivers/fsl_spi.c' projectpath='drivers'/>
        <file category='include' name='devices/MKM33ZA5/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='spi_dma' Cversion='2.1.1' condition='driver.spi_dma.condition_id'>
      <description>SPI Driver</description>
      <files>
        <file category='header' name='devices/MKM33ZA5/drivers/fsl_spi_dma.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MKM33ZA5/drivers/fsl_spi_dma.c' projectpath='drivers'/>
        <file category='include' name='devices/MKM33ZA5/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='sysmpu' Cversion='2.2.3' condition='driver.sysmpu.condition_id'>
      <description>SYSMPU Driver</description>
      <files>
        <file category='header' name='devices/MKM33ZA5/drivers/fsl_sysmpu.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MKM33ZA5/drivers/fsl_sysmpu.c' projectpath='drivers'/>
        <file category='include' name='devices/MKM33ZA5/drivers/'/>
      </files>
    </component>
