vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MKM33ZA5_DFP.pdsc
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='uart' Cversion='2.5.1' condition='driver.uart.condition_id'>
      <description>UART Driver</description>
      <files>
        <file category='header' name='devices/MKM33ZA5/drivers/fsl_uart.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MKM33ZA5/drivers/fsl_uart.c' projectpath='drivers'/>
        <file category='include' name='devices/MKM33ZA5/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='uart_dma' Cversion='2.5.0' condition='driver.uart_dma.condition_id'>
      <description>UART Driver</description>
      <files>
        <file category='header' name='devices/MKM33ZA5/drivers/fsl_uart_dma.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MKM33ZA5/drivers/fsl_uart_dma.c' projectpath='drivers'/>
        <file category='include' name='devices/MKM33ZA5/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='vref' Cversion='2.1.3' condition='driver.vref.condition_id'>
      <description>VREF Driver</description>
      <files>
        <file category='header' name='devices/MKM33ZA5/drivers/fsl_vref.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MKM33ZA5/drivers/fsl_vref.c' projectpath='drivers'/>
        <file category='include' name='devices/MKM33ZA5/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='wdog' Cversion='2.0.2' condition='driver.wdog.condition_id'>
      <description>WDOG Driver</description>
      <files>
        <file category='header' name='devices/MKM33ZA5/drivers/fsl_wdog.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MKM33ZA5/drivers/fsl_wdog.c' projectpath='drivers'/>
        <file category='include' name='devices/MKM33ZA5/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='xbar' Cversion='2.1.0' condition='driver.xbar.condition_id'>
      <description>XBAR Driver</description>
      <files>
        <file category='header' name='devices/MKM33ZA5/drivers/fsl_xbar.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MKM33ZA5/drivers/fsl_xbar.c' projectpath='drivers'/>
        <file category='include' name='devices/MKM33ZA5/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Utilities' Csub='misc_utilities' Cversion='1.1.1' condition='utilities.misc_utilities.condition_id'>
      <description>
        Utilities which is needed for particular toolchain like the SBRK function required to address limitation between HEAP and STACK in GCC toolchain library.
      </description>
      <files>
        <file condition='allOf.toolchains=armgcc.condition_id' category='sourceC' name='devices/MKM33ZA5/utilities/fsl_syscall_stub.c' projectpath='utilities'/>
        <file condition='allOf.toolchains=armgcc.condition_id' category='sourceC' name='devices/MKM33ZA5/utilities/fsl_sbrk.c' projectpath='utilities'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Utilities' Csub='assert' Cversion='1.0.0' condition='utility.assert.condition_id'>
      <description>Utility assert</description>
      <files>
        <file category='header' name='devices/MKM33ZA5/utilities/debug_console/fsl_assert.h' projectpath='utilities'/>
        <file category='sourceC' name='devices/MKM33ZA5/utilities/debug_console/fsl_assert.c' projectpath='utilities'/>
        <file category='include' name='devices/MKM33ZA5/utilities/debug_console/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Utilities' Csub='assert_lite' Cversion='1.0.0' condition='utility.assert_lite.condition_id'>
      <description>Utility assert_lite</description>
      <files>
        <file category='header' name='devices/MKM33ZA5/utilities/debug_console_lite/fsl_assert.h' projectpath='utilities'/>
        <file category='sourceC' name='devices/MKM33ZA5/utilities/debug_console_lite/fsl_assert.c' projectpath='utilities'/>
        <file category='include' name='devices/MKM33ZA5/utilities/debug_console_lite/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Utilities' Csub='debug_console' Cversion='1.0.1' condition='utility.debug_console.condition_id'>
      <description>Utility debug_console</description>
      <files>
        <file category='header' name='devices/MKM33ZA5/utilities/debug_console/fsl_debug_console.h' projectpath='utilities/debug_console'/>
        <file category='sourceC' name='devices/MKM33ZA5/utilities/debug_console/fsl_debug_console.c' projectpath='utilities/debug_console'/>
        <file category='include' name='devices/MKM33ZA5/utilities/debug_console/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Utilities' Csub='debug_console_lite' Cversion='1.0.0' condition='utility.debug_console_lite.condition_id'>
      <description>Utility debug_console_lite</description>
      <files>
        <file category='header' name='devices/MKM33ZA5/utilities/debug_console_lite/fsl_debug_console.h' projectpath='utilities/debug_console_lite'/>
        <file category='sourceC' name='devices/MKM33ZA5/utilities/debug_console_lite/fsl_debug_console.c' projectpath='utilities/debug_console_lite'/>
        <file category='include' name='devices/MKM33ZA5/utilities/debug_console_lite/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Utilities' Csub='debug console template config' Cversion='1.0.0' condition='utility.debug_console_template_config.condition_id'>
      <description>Utility debug_console Template Config</description>
      <files>
        <file category='header' attr='config' name='devices/MKM33ZA5/utilities/debug_console/config/fsl_debug_console_conf.h' version='1.0.0' projectpath='utilities/debug_console/config'/>
      </files>
    </component>
